# Всех приветствую!
# Данная программа создана для нахождения самого большого числа из трех чисел!
# Version: 1.1.3

# code:

num1 = float(input("Отправьте первое число: "))
num2 = float(input("Отправьте второе число: "))
num3 = float(input("Отправьте третье число: "))

# Находим максимальное число
max_num = max(num1, num2, num3)

# Вывод результата
print("---------------------------------------------")
print("Успешно! Максимальное число:", max_num)
print("Если число неверное - повторите попытку.")
print("---------------------------------------------")

print("                 (◕‿◕)")
