# Генератор случайных чисел by Misha

import random


def generate_random_number(start, end):
    return random.randint(start, end)


print("Добро пожаловать в генератор GH! Вам выдано 3 бесплатных использования")
print("")
print("")
print("Выберите операцию: ")
print("1. Сгенерировать число")
print("2. Просмотреть информацию о приложении")
print("3. Информация о подписке")
print("")
print("")

choice = input("Введите номер операции: ")
print("")

if choice == '1':
    start = int(input("Введите начальное значение: "))
    end = int(input("Введите последнее значение: "))

    random_number = generate_random_number(start, end)

    print("----------------------------!!!!!!---------------------------")
    print(f"Случайное число от {start} до {end} успешно сгенерировано:")
    print(f"              Случайное число: {random_number}")
    print("----------------------------!!!!!!---------------------------")
elif choice == '2':
    print("----------------------------------------------------------------------------")
    print("Данное приложение создано 29.08.2025! Для генерирования чисел! Удачи в использовании :) ")
    print("----------------------------------------------------------------------------")
elif choice == '3':
    print("----------------------------------------------------------------------------")
    print("Текущая подписка: FREE")
    print("Для получения PREMIUM подписки нужно использовать генератор более 50 раз.")
    print("----------------------------------------------------------------------------")

